src/test/jmeter/judgeTest.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="测试计划" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义的变量" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="线程组" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">15</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP请求" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;language&quot;: &quot;C_PLUS_PLUS&quot;,&#xd;
    &quot;resolutions&quot;: [&#xd;
        {&#xd;
            &quot;input&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_0.in&quot;,&#xd;
            &quot;expectedOutput&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_0.out&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;input&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_1.in&quot;,&#xd;
            &quot;expectedOutput&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_1.out&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;input&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_2.in&quot;,&#xd;
            &quot;expectedOutput&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_2.out&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;input&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_3.in&quot;,&#xd;
            &quot;expectedOutput&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_3.out&quot;&#xd;
        },&#xd;
        {&#xd;
            &quot;input&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_4.in&quot;,&#xd;
            &quot;expectedOutput&quot;: &quot;http://qc8mhtkrp.bkt.clouddn.com/map_test_4.out&quot;&#xd;
        }&#xd;
    ],&#xd;
    &quot;submissionCode&quot;: &quot;#include &lt;iostream&gt;\n#include&lt;map&gt;\n#include &lt;cstdio&gt;\nusing namespace std;\n\nint main()\n{\n    int n;\n    scanf(\&quot;%d\&quot;, &amp;n);\n    map&lt;string, int&gt;mp;\n    string s;\n    char c;\n    getchar();\n    getline(cin, s);\n    for(int i = 0; i &lt; s.length() - n + 1; i++) mp[s.substr(i, n)]++;\n    map&lt;string,int&gt;::iterator pointer;\n    string resolution;\n    int max = 0;\n    for(pointer = mp.begin(); pointer != mp.end(); pointer++)\n    {\n        if(pointer -&gt; second &gt; max)\n        {\n            max = pointer -&gt; second;\n            resolution = pointer -&gt; first;\n        }\n    }\n    printf(\&quot;%s %d\&quot;, resolution.c_str(), max);\n    return 0;\n}&quot;,&#xd;
    &quot;judgePreference&quot;: &quot;OI&quot;,&#xd;
    &quot;outputLimit&quot;: 1000000,&#xd;
    &quot;realTimeLimit&quot;: 1&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">47.106.202.255</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">judge/run</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">false</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.BROWSER_COMPATIBLE_MULTIPART">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP信息头管理器" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">accessToken</stringProp>
                <stringProp name="Header.value">eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJ1c2VySWQiOiJ5emwiLCJpYXQiOjE1OTM2OTE1Nzl9.6iXiQWK0l8ysGpjTutltZw1JJdOAjjHSaensgHY9kxE</stringProp>
              </elementProp>
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResultCollector guiclass="TableVisualizer" testclass="ResultCollector" testname="用表格察看结果" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="察看结果树" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>